constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    rotor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          144;
        startFace       5640;
    }
    freestream
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          96;
        startFace       5784;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          5760;
        startFace       5880;
    }
)

// ************************************************************************* //
